x = 0;
y = 0;
a = input("Введите направление: ")
b = a.split()
while (b[0] != 'СТОП'):
    if (b[0] == 'Влево'):
        x -= int(b[1]);
        print("Ваши координаты:({},{})".format(x,y))
    elif (b[0] == 'Вправо'):
        x += int(b[1]);
        print("Ваши координаты:({},{})".format(x,y))
    elif (b[0] == 'Вверх'):
        y += int(b[1]);
        print("Ваши координаты:({},{})".format(x,y))
    elif (b[0] == 'Вниз'):
        y -= int(b[1]);
        print("Ваши координаты:({},{})".format(x,y))
    else:
        print('Ошибка! Неправильный формат ввода данных.')
    b = input("Введите направление: ")
    b = b.split()
print("Ваши итоговые координаты местоположения:({},{})".format(x,y))
